# IsGlazingShaded Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..IsGlazingShaded Property
EnergyDataSettings Class See Also
---
If this is true, glazing/windows that are auto-created on exterior walls will automatically have a shading device created on their top edge.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsGlazingShaded { get; set; }
```

Visual Basic
---
```text
Public Property IsGlazingShaded As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsGlazingShaded {
	bool get ();
	void set (bool value);
}
```

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace